local function games(msg)
local text = msg.content_.text_
if text == 'الالعاب' and database:get(bot_id..'Lock:Games'..msg.chat_id_) then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'🗳️| لا تستطيع استخدام البوت يرجى الاشتراك في القناة حتى تتمكن من استخدام الاوامر \n 📌| اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
Text_Games = [[
⚜┇اوامر الالعاب كالتالي √
◣──◐~❉الـراقـي❉~◐──◢
✅┇تفعيل العاب البوت • لتفعيل الالعاب
❎┇تعطيل العاب البوت • لتعطيل الالعاب
◣──◐~❉الـراقـي❉~◐──◢
🕹┇الالعاب الخاصه بالسورس √
◣──◐~❉الـراقـي❉~◐──◢
📜╿•⊱محيبس ༜ لعبه محيبس الشهيره
🎰│•⊱سمايلات ༜  ارسال السمايلات
🎯│•⊱رياضيات ༜ لعبة الرياضيات
📜│⊱امثله ༜ لعبه امثله قديمه
🎰│•⊱معاني ༜ لعبه معاني لسمايلات 
📋│•⊱اسئله ༜ لعبه اسئله عامه
🤔│•⊱حزوره ༜ لعبه الحزورات
🎨│•⊱ترتيب ༜ لعبه ترتيب الكلمات
♻️│•⊱العكس ༜ لعبه عكس الكلمه
🎁│•⊱تخمين ༜ لعبه تخمين الكلمه 
🤹‍♂│•⊱الاسرع ༜ لعبه اسرع واحد 
♻️│•⊱كت تويت ༜ لعبه التسليه 
🔆│•⊱انجليزي ༜ لعبه ترجمة انجليزي
♒│•⊱تفكيك ༜ لعبه تفكيك الكلمات
✅│•⊱تركيب ༜ لعبه تركيب الكلمات
🏁│•⊱علم الدول ༜ لعبة اعلام الدول
🚦╽•⊱المختلف ༜ لعبه اختلاف لسمايل
◣──◐~❉الـراقـي❉~◐──◢
]]
send(msg.chat_id_, msg.id_,Text_Games) 
end

if text == 'السمايلات' or text == 'السمايل' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'🗳️| لا تستطيع استخدام البوت يرجى الاشتراك في القناة حتى تتمكن من استخدام الاوامر \n 📌| اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
database:del(bot_id..'Set:Sma'..msg.chat_id_)
Random = {'🍏','🍎','🍐','🍊','??','🍉','🍇','🍓','🍈','🍒','🍑','🍍','??','🥝','🍅','🍆','🥑','🥦','🥒','🌶','🌽','🥕','🥔','🥖','🥐','🍞','🥨','🍟','🧀','🥚','🍳','🥓','🥩','🍗','🍖','🌭','🍔','🍠','🍕','🥪','🥙','☕️','🍵','🥤','🍶','🍺','🍻','🏀','⚽️','🏈','⚾️','🎾','🏐','🏉','🎱','🏓','🏸','🥅','🎰','🎮','🎳','🎯','🎲','🎻','🎸','🎺','🥁','🎹','🎼','🎧','🎤','🎬','🎨','🎭','🎪','🎟','🎫','🎗','🏵','🎖','🏆','🥌','🛷','🚗','🚌','🏎','🚓','🚑','🚚','🚛','🚜','🇮🇶','⚔','🛡','🔮','🌡','💣','📌','📍','📓','📗','📂','📅','📪','📫','📬','📭','⏰','📺','🎚','☎️','📡'}
SM = Random[math.random(#Random)]
database:set(bot_id..'Random:Sm'..msg.chat_id_,SM)
send(msg.chat_id_, msg.id_,'✧| اسرع واحد يرسل هاذا السمايل ?* » {`'..SM..'`}*')
return false
end
end
if text == ''..(database:get(bot_id..'Random:Sm'..msg.chat_id_) or '')..'' and not database:get(bot_id..'Set:Sma'..msg.chat_id_) then
if not database:get(bot_id..'Set:Sma'..msg.chat_id_) then 
send(msg.chat_id_, msg.id_,'*✧ احسنت اجـابـتـك صـحيـحـة ✧*')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 1)  
end
database:set(bot_id..'Set:Sma'..msg.chat_id_,true)
return false
end 
if text == 'ترتيب' or text == 'الترتيب' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'🗳️| لا تستطيع استخدام البوت يرجى الاشتراك في القناة حتى تتمكن من استخدام الاوامر \n 📌| اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
database:del(bot_id..'Speed:Tr'..msg.chat_id_)
KlamSpeed = {'سحور','سياره','استقبال','مصر','قنفه','ايفون','بزونه','مطبخ','كرستيانو','دجاجه','مدرسه','الوان','غرفه','ثلاجه','قهوه','سفينه','العراق','محطه','طياره','رادار','منزل','مستشفى','سوريا','كهرباء','تفاحه','اخطبوط','سلمون',' فرنسا','برتقاله','تفاح','مطرقه','بتيته','لهانه','شباك','باص','سمكه','ذباب','تلفاز','حاسوب','انترنيت','اليمن','السعوديه','لبنان','جسر'};
name = KlamSpeed[math.random(#KlamSpeed)]
database:set(bot_id..'Klam:Speed'..msg.chat_id_,name)
name = string.gsub(name,'سحور','س ر و ح')
name = string.gsub(name,'سياره','ه ر س ي ا')
name = string.gsub(name,'استقبال','ل ب ا ت ق س ا')
name = string.gsub(name,'قنفه','ه ق ن ف')
name = string.gsub(name,'ايفون','و ن ف ي ا')
name = string.gsub(name,'بزونه','ز و ه ب ن')
name = string.gsub(name,'مطبخ','خ ب ط م')
name = string.gsub(name,'كرستيانو','س ت ا ن و ك ر ي')
name = string.gsub(name,'دجاجه','ج ج ا د ه')
name = string.gsub(name,'مدرسه','ه م د ر س')
name = string.gsub(name,'الوان','ن ا و ا ل')
name = string.gsub(name,'غرفه','غ ه ر ف')
name = string.gsub(name,'ثلاجه','ج ه ث ل ا')
name = string.gsub(name,'قهوه','ه و ق ه')
name = string.gsub(name,'سفينه','ه ن ف ي س')
name = string.gsub(name,'العراق','ق ع ا ل ر ا')
name = string.gsub(name,'محطه','ه ط م ح')
name = string.gsub(name,'طياره','ر ا ط ي ه')
name = string.gsub(name,'اليمن','ا ي ل ن م')
name = string.gsub(name,'رادار','ر ا ر ا د')
name = string.gsub(name,'منزل','ن ز م ل')
name = string.gsub(name,'السعوديه','س ا ل ه د ي ع و')
name = string.gsub(name,'لبنان','ل ن ب ن ا')
name = string.gsub(name,'سوريا','و س ي ا ر')
name = string.gsub(name,'مستشفى','ى ش س ف ت م')
name = string.gsub(name,'كهرباء','ر ب ك ه ا ء')
name = string.gsub(name,'تفاحه','ح ه ا ت ف')
name = string.gsub(name,'اخطبوط','ط ب و ا خ ط')
name = string.gsub(name,'سلمون','ن م و ل س')
name = string.gsub(name,'فرنسا','ن ف ر س ا')
name = string.gsub(name,'برتقاله','ر ت ق ب ا ه ل')
name = string.gsub(name,'تفاح','ح ف ا ت')
name = string.gsub(name,'مطرقه','ه ط م ر ق')
name = string.gsub(name,'بتيته','ب ت ت ي ه')
name = string.gsub(name,'لهانه','ه ن ل ه ل')
name = string.gsub(name,'شباك','ب ش ا ك')
name = string.gsub(name,'باص','ص ا ب')
name = string.gsub(name,'مصر','ص ر م')
name = string.gsub(name,'سمكه','ك س م ه')
name = string.gsub(name,'ذباب','ب ا ب ذ')
name = string.gsub(name,'تلفاز','ت ف ل ز ا')
name = string.gsub(name,'حاسوب','س ا ح و ب')
name = string.gsub(name,'انترنيت','ا ت ن ر ن ي ت')
name = string.gsub(name,'ساحه','ح ا ه س')
name = string.gsub(name,'جسر','ر ج س')
send(msg.chat_id_, msg.id_,'✧| اسرع واحد يرتبها* » {'..name..'}*')
return false
end
end
------------------------------------------------------------------------
if text == ''..(database:get(bot_id..'Klam:Speed'..msg.chat_id_) or '')..'' and not database:get(bot_id..'Speed:Tr'..msg.chat_id_) then
if not database:get(bot_id..'Speed:Tr'..msg.chat_id_) then 
send(msg.chat_id_, msg.id_,'*✧ احسنت اجـابـتـك صـحيـحـة ✧*')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 1)  
end
database:set(bot_id..'Speed:Tr'..msg.chat_id_,true)
end 

if text == 'تركيب' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'🗳️| لا تستطيع استخدام البوت يرجى الاشتراك في القناة حتى تتمكن من استخدام الاوامر \n 📌| اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
database:del(bot_id..'Trk:Tr'..msg.chat_id_)
KlamTrk = {'احبك','ذئب','بعير','طير','ورده','جميل ','حلو','بطريق','طماطم','موز','سيارة','تحريك','فلوس','بوت','ثقة','حلزون','مكيف','مروحه'};
name = KlamTrk[math.random(#KlamTrk)]
database:set(bot_id..'Klam:Trk'..msg.chat_id_,name)
name = string.gsub(name,'احبك','ا ح ب ك')
  name = string.gsub(name,'ذئب','ذ ئ ب')
  name = string.gsub(name,'بعير','ب ع ي ر')
  name = string.gsub(name,'طير','ط ي ر')
  name = string.gsub(name,'ورده','و ر د ه')
  name = string.gsub(name,'جميل','ج م ي ل')
  name = string.gsub(name,'حلو','ح ل و')
  name = string.gsub(name,'بطريق','ب ط ر ي ق')
  name = string.gsub(name,'طماطم','ط م ا ط م')
  name = string.gsub(name,'موز','م و ز')
  name = string.gsub(name,'سيارة','س ي ا ر ة')
  name = string.gsub(name,'تحريك','ت ح ر ي ك')
  name = string.gsub(name,'فلوس','ف ل و س')
  name = string.gsub(name,'بوت','ب و ت')
  name = string.gsub(name,'ثقة','ث ق ة')
  name = string.gsub(name,'حلزون','ح ل ز و ن')
  name = string.gsub(name,'مكيف','م ك ي ف')
  name = string.gsub(name,'مروحه','م ر و ح ه')
send(msg.chat_id_, msg.id_,'✧| اسرع واحد يركب الكلمة* » {'..name..'}*')
return false
end
end
------------------------------------------------------------------------
if text == ''..(database:get(bot_id..'Klam:Trk'..msg.chat_id_) or '')..'' and not database:get(bot_id..'Trk:Tr'..msg.chat_id_) then
if not database:get(bot_id..'Trk:Tr'..msg.chat_id_) then 
send(msg.chat_id_, msg.id_,'*✧ احسنت اجـابـتـك صـحيـحـة ✧*')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 1)  
end
database:set(bot_id..'Trk:Tr'..msg.chat_id_,true)
end 
if text == 'تفكيك' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'🗳️| لا تستطيع استخدام البوت يرجى الاشتراك في القناة حتى تتمكن من استخدام الاوامر \n 📌| اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
database:del(bot_id..'Tfkk:Tr'..msg.chat_id_)
KlamTfkk = {'ا ح ب ك','ذ ئ ب','ب ع ي ر','ط ي ر','و ر د ه','ج م ي ل ','ح ل و','ب ط ر ي ق','ط م ا ط م','م و ز','س ي ا ر ة','ت ح ر ي ك','ف ل و س','ب و ت','ث ق ة','ح ل ز و ن','م ك ي ف','م ر و ح ه'};
name = KlamTfkk[math.random(#KlamTfkk)]
database:set(bot_id..'Klam:Tfkk'..msg.chat_id_,name)
name = string.gsub(name,'ا ح ب ك','احبك')
  name = string.gsub(name,'ا ك ر ه ك','اكرهك')
  name = string.gsub(name,'ذ ئ ب','ذئب')
  name = string.gsub(name,'ب ع ي ر','بعير')
  name = string.gsub(name,'ط ي ر','طير')
  name = string.gsub(name,'و ر د ه','ورده')
  name = string.gsub(name,'ج م ي ل','جميل')
  name = string.gsub(name,'ح ل و','حلو')
  name = string.gsub(name,'ب ط ر ي ق','بطريق')
  name = string.gsub(name,'ط م ا ط م','طماطم')
  name = string.gsub(name,'م و ز','موز')
  name = string.gsub(name,'س ي ا ر ة','سيارة')
  name = string.gsub(name,'ت ح ر ي ك','تحريك')
  name = string.gsub(name,'ف ل و س','فلوس')
  name = string.gsub(name,'ب و ت','بوت')
  name = string.gsub(name,'ث ق ة','ثقة')
  name = string.gsub(name,'ح ل ز و ن','حلزون')
  name = string.gsub(name,'م ك ي ف','مكيف')
  name = string.gsub(name,'م ر و ح ه','مروحه')
send(msg.chat_id_, msg.id_,'✧| اسرع واحد يفكك الكلمة* » {'..name..'}*')
return false
end
end
------------------------------------------------------------------------
if text == ''..(database:get(bot_id..'Klam:Tfkk'..msg.chat_id_) or '')..'' and not database:get(bot_id..'Tfkk:Tr'..msg.chat_id_) then
if not database:get(bot_id..'Tfkk:Tr'..msg.chat_id_) then 
send(msg.chat_id_, msg.id_,'*✧ احسنت اجـابـتـك صـحيـحـة ✧*')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 1)  
end
database:set(bot_id..'Tfkk:Tr'..msg.chat_id_,true)
end 

if text == 'الحزوره' or text == 'حزوره' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'🗳️| لا تستطيع استخدام البوت يرجى الاشتراك في القناة حتى تتمكن من استخدام الاوامر \n 📌| اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
database:del(bot_id..'Set:Hzora'..msg.chat_id_)
Hzora = {'امي','انا','المخده','الهواء','الهواء','القمر','المقفل','النهر','الغيم','اسمك','حرف الام','الضابط','الدائره','الجمعة','ابل','الصمت','السلحفات','كم الساعه','شجره العائله','ضفدع','خليه النحل','الصوت','الجوع','الكتاب','البيض','الاسفنجه','البرتقال','الكفن','الساعه','الطاولة','البصل','الوقت','النار','الثلج','العمر','المسمار','الحفره','المشط','الجوال','الجرس','المراه','الغداء','الفيل','الصدى','الهواء','عقرب الساعه'};
name = Hzora[math.random(#Hzora)]
database:set(bot_id..'Klam:Hzor'..msg.chat_id_,name)
name = string.gsub(name,'امي','اخت خالك ومهي خالتك منهي؟')
name = string.gsub(name,'انا','ورع امك وورع ابوك ومهي اختك ولاخوك منهو؟')
name = string.gsub(name,'المخده','انا خفيفه وانا لطيفه اقعد بحضن الخليفه أزيح الهموم  واخلي الحييب نايم من انا؟')
name = string.gsub(name,'الهواء','ماهو الشيء الذي يسير امامك ولا تراه؟')
name = string.gsub(name,'القمر','ماهو الشيء الذي يحيا اول الشهر ويموت في اخره؟')
name = string.gsub(name,'المقفل','وش الباب الي ما يمديك تفتحه؟')
name = string.gsub(name,'النهر','ماهو الشي الذي يجري ولا يمشي؟')
name = string.gsub(name,'الغيم','ماهو الشي الذي يمشي بلا رجلين ويبكي بلا عيون؟')
name = string.gsub(name,'اسمك','ماهو الشيء الذي لك ويستخدمه الناس من دون اذنك؟')
name = string.gsub(name,'حرف الام','ماهو الشيء الذي تراه في الليل ثلاث مرات والنهار مره واحده؟')
name = string.gsub(name,'الضابط','رجوله في الارض وراسه فوق النجوم؟')
name = string.gsub(name,'الدائره','ماهو الشيء الذي ليس له بدايه وليس له نهاية؟')
name = string.gsub(name,'الجمعة','لدينا ثلاث أعياد ليس عيد الفطر وليس عيد الاضحى فما هو؟')
name = string.gsub(name,'ابل','تفاحة ماكول نصها وش هي؟')
name = string.gsub(name,'الصمت','ماهي الكلمه الذي يبطل معناها اذا نطقت بها؟ ')
name = string.gsub(name,'السلحفاة','ماهو الذي لحمهه من الداخل وعضمهه من الخارج؟ ')
name = string.gsub(name,'كم الساعه','ماهوه السؤال الذي تختلف اجابته دائماً؟')
name = string.gsub(name,'شجره العائله','ما اسم الشجره التي ليس لها ضل ولا لها ثمار؟ ')
name = string.gsub(name,'الضفدع','ماهو الحيوان الذي لسانه طويل وجسمه صغير؟')
name = string.gsub(name,'خليه النحل','ماهو الشيء الذي يتسع مئاات الالوف ولا يتسع طير منتوف؟')
name = string.gsub(name,'الصوت','اسير بلا رجلين ولا ادخل الا ب الاذنين؟')
name = string.gsub(name,'الجوع','ماهو الشيء الذي يقرصك ولا تراه؟')
name = string.gsub(name,'الكتاب','له اوراق وما هو بنبات، له جلد وماهو بحيوان . وعلم وماهو ب انسان من هو؟')
name = string.gsub(name,'البيض','ماهو الشي الذي اسمه على لونه؟')
name = string.gsub(name,'الاسفنجه','كلي ثقوب ومع ذالك احفظ الماء فمن انا؟ ')
name = string.gsub(name,'البرتقال','ماهو الشيء نرميه بعد العصر؟')
name = string.gsub(name,'الكفن','ماهو الشيء لاتحب ان تلبسة وان لبستة لاترة؟')
name = string.gsub(name,'الساعه','ماهو الشيء الذي يمشي ويقف وليس له ارجل؟')
name = string.gsub(name,'الطاولة','اننا اربعة اخوه ولنا راس واحد فمن نحن؟')
name = string.gsub(name,'البصل','شيء تذبحه وتبكي عليه؟')
name = string.gsub(name,'الوقت','يذهب ولا يرجع؟')
name = string.gsub(name,'النار','شيء ياكل ولايشبع وان شرب الماء مات؟')
name = string.gsub(name,'الثلج','شيء مصنوع من الماء وان عاش في الماء يموت؟')
name = string.gsub(name,'العمر','ماهو الشيء الذي كلما زاد نقص؟')
name = string.gsub(name,'المسمار','ماهو الشيء الذي لا يمشي الا ب الضرب؟')
name = string.gsub(name,'الحفره','ماهو الشيء الذي كلما اخذنا منهه زاد وكبر؟')
name = string.gsub(name,'المشط','له اسنان ولا يعض ماهو؟ ')
name = string.gsub(name,'الجوال','يسمع بلا اذن ويحكي بلا لسان فما هو؟')
name = string.gsub(name,'الجرس','ماهو الشيء الذي اذا لمسته صاح؟')
name = string.gsub(name,'المراه','ارى كل شيء من دون عيون فمن اكون؟')
name = string.gsub(name,'الغداء','ماهو الشيء الذي لايؤكل في الليل؟ ')
name = string.gsub(name,'الفيل','من هوه الحيوان الذي يحك اذنه في انفه؟')
name = string.gsub(name,'الصدى','ماهو الشيء الذي يتكلم جميع اللغات؟ ')
name = string.gsub(name,'الهواء','شيء بيني وبينك لا تراه عينك ولا عيني فما هوه؟')
name = string.gsub(name,'عقرب الساعه','هناك عقرب لا يلدغ ولا يخاف منه الاطفال فما هوه؟')
send(msg.chat_id_, msg.id_,'✧| اسرع واحد يحل الحزوره ↓*\n {'..name..'}*')
return false
end
end
------------------------------------------------------------------------
if text == ''..(database:get(bot_id..'Klam:Hzor'..msg.chat_id_) or '')..'' and not database:get(bot_id..'Set:Hzora'..msg.chat_id_) then
if not database:get(bot_id..'Set:Hzora'..msg.chat_id_) then 
send(msg.chat_id_, msg.id_,'*✧ احسنت اجـابـتـك صـحيـحـة ✧*')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 1)  
end
database:set(bot_id..'Set:Hzora'..msg.chat_id_,true)
end 
if text == 'كت تويت' or text == 'تويت' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'🗳️| لا تستطيع استخدام البوت يرجى الاشتراك في القناة حتى تتمكن من استخدام الاوامر \n 📌| اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
database:del(bot_id..'Set:Twt'..msg.chat_id_)
Twt = {' دحوو1م ',' دحوو2م ',' دحوو3م ',' دحوو4م ',' دحوو5م ',' دحوو6م ',' دحوو7م ',' دحوو8م ',' دحوو9م ',' دحوو10م ',' دحوو11م ',' دحوو12م ',' دحوو13م ',' دحوو14م ',' دحوو15م ',' دحوو16م ',' دحوو17م ',' دحوو18م ',' دحوو19م ',' دحوو20م ',' دحوو21م ',' دحوو22م ',' دحوو23م ',' دحوو24م ',' دحوو25م ',' دحوو26م ',' دحوو27م ',' دحوو28م ',' دحوو29م ',' دحوو30م ',' دحوو31م ',' دحوو32م ',' دحوو33م ',' دحوو34م ',' دحوو35م ',' دحوو36م ',' دحوو37م ',' دحوو38م ',' دحوو39م ',' دحوو40م ',' دحوو41م ',' دحوو42م ',' دحوو43م ',' دحوو44م ',' دحوو45م ',' دحوو46م ',' دحوو47م ',' دحوو48م ',' دحوو49م ',' دحوو50م ',' دحوو51م ',' دحوو52م ',' دحوو53م ',' دحوو54م ',' دحوو55م','دحوو1م ',' دحوو2م ',' دحوو3م ',' دحوو4م ',' دحوو5م ',' دحوو6م ',' دحوو7م ',' دحوو8م ',' دحوو9م ',' دحوو10م ',' دحوو11م ',' دحوو12م ',' دحوو13م ',' دحوو14م ',' دحوو15م ',' دحوو16م ',' دحوو17م ',' دحوو18م ',' دحوو19م ',' دحوو20م ',' دحوو21م ',' دحوو22م ',' دحوو23م ',' دحوو24م ',' دحوو25م ',' دحوو26م ',' دحوو27م ',' دحوو28م ',' دحوو29م ',' دحوو30م ',' دحوو31م ',' دحوو32م ',' دحوو33م ',' دحوو34م ',' دحوو35م ',' دحوو36م ',' دحوو37م ',' دحوو38م ',' دحوو39م ',' دحوو40م ',' دحوو41م ',' دحوو42م ',' دحوو43م ',' دحوو44م ',' دحوو45م ',' دحوو46م ',' دحوو47م ',' دحوو48م ',' دحوو49م ',' دحوو50م ',' دحوو51م ',' دحوو52م ',' دحوو53م ',' دحوو54م ',' دحوو55م ',' دحوو56م ',' دحوو57م ',' دحوو58م ',' دحوو59م ',' دحوو60م ',' دحوو61م ',' دحوو62م ',' دحوو63م ',' دحوو64م ',' دحوو65م ',' دحوو66م ',' دحوو67م ',' دحوو68م ',' دحوو69م ',' دحوو70م ',' دحوو71م ',' دحوو72م ',' دحوو73م ',' دحوو74م ',' دحوو75م ',' دحوو76م ',' دحوو77م ',' دحوو78م ',' دحوو79م ',' دحوو80م ',' دحوو81م ',' دحوو82م ',' دحوو83م ',' دحوو84م ',' دحوو85م ',' دحوو86م ',' دحوو87م ',' دحوو88م ',' دحوو89م ',' دحوو90م ',' دحوو91م ',' دحوو92م ',' دحوو93م ',' دحوو94م ',' دحوو95م ',' دحوو96م ',' دحوو97م ',' دحوو98م ',' دحوو99م ',' دحوو100م ',' دحوو101م ',' دحوو102م ',' دحوو103م ',' دحوو104م ',' دحوو105م ',' دحوو106م ',' دحوو107م ',' دحوو108م ',' دحوو109م ',' دحوو110م ',' دحوو111م ',' دحوو112م ',' دحوو113م ',' دحوو114م ',' دحوو115م ',' دحوو116م ',' دحوو117م ',' دحوو118م ',' دحوو119م ',' دحوو120م ',' دحوو121م ',' دحوو121م ',' دحوو122م '};
name = Twt[math.random(#Twt)]
database:set(bot_id..'Klam:Twt'..msg.chat_id_,name)
name = string.gsub(name,' دحوو1م ',' نسبة رضاك عن الأشخاص من حولك هالفترة ؟ ')
name = string.gsub(name,' دحوو2م ',' ما السيء في هذه الحياة ؟ ')
name = string.gsub(name,' دحوو3م ','الفلوس او الحب ؟')
name = string.gsub(name,' دحوو4م ',' أجمل شيء حصل معك خلال هذا الاسبوع ؟ ')
name = string.gsub(name,' دحوو5م ',' سؤال ينرفزك ؟ ')
name = string.gsub(name,' دحوو6م ',' كم في حسابك البنكي ؟ ')
name = string.gsub(name,' دحوو7م ','اكثر ممثل تحبه ؟ ')
name = string.gsub(name,' دحوو8م ',' قد تخيلت شي في بالك وصار ؟ ')
name = string.gsub(name,' دحوو9م ',' كلمة لشخص أسعدك رغم حزنك في يومٍ من الأيام ؟ ')
name = string.gsub(name,' دحوو10م ',' شيء عندك اهم من الناس ؟ ')
name = string.gsub(name,' دحوو11م ',' اول ولد لك وش راح تسميه ؟ ')
name = string.gsub(name,' دحوو12م ',' تفضّل النقاش الطويل او تحب الاختصار ؟ ')
name = string.gsub(name,' دحوو13م ',' وش أخر شي ضيعته؟ ')
name = string.gsub(name,' دحوو14م ',' عادي تتزوج من برا القبيلة؟ ')
name = string.gsub(name,' دحوو15م ',' كم مره حبيت؟ ')
name = string.gsub(name,' دحوو16م ','تبادل الكراهية بالكراهية؟ ولا تحرجه بالطيب؟')
name = string.gsub(name,' دحوو17م ','لو فزعت/ي لصديق/ه وقالك مالك دخل وش بتسوي/ين؟')
name = string.gsub(name,' دحوو18م ','قلبي على قلبك مهما صار لمين تقولها؟')
name = string.gsub(name,' دحوو19م ','اكثر المتابعين عندك باي برنامج؟')
name = string.gsub(name,' دحوو20م ','نسبة النعاس عندك حاليًا؟')
name = string.gsub(name,' دحوو21م ','نسبه الندم عندك للي وثقت فيهم ؟')
name = string.gsub(name,' دحوو22م ','وش اسم اول شخص تعرفت عليه فالتلقرام ؟')
name = string.gsub(name,' دحوو23م ','جربت شعور احد يحبك بس انت مو قادر تحبه؟')
name = string.gsub(name,' دحوو24م ','تجامل الناس ولا اللي بقلبك على لسانك؟')
name = string.gsub(name,' دحوو25م ','عمرك ضحيت باشياء لاجل شخص م يسوى ؟')
name = string.gsub(name,' دحوو26م ',' مغني تلاحظ أن صوته يعجب الجميع إلا أنت؟ ')
name = string.gsub(name,' دحوو27م ','آخر غلطات عمرك؟ ')
name = string.gsub(name,' دحوو28م ','مسلسل كرتوني له ذكريات جميلة عندك؟ ')
name = string.gsub(name,' دحوو29م ','ما أكثر تطبيق تقضي وقتك عليه؟ ')
name = string.gsub(name,' دحوو30م ','أول شيء يخطر في بالك إذا سمعت كلمة نجوم ؟ ')
name = string.gsub(name,' دحوو31م ','قدوتك من الأجيال السابقة؟ ')
name = string.gsub(name,' دحوو32م ','أكثر طبع تهتم بأن يتواجد في شريك/ة حياتك؟ ')
name = string.gsub(name,' دحوو33م ',' أكثر حيوان تخاف منه؟ ')
name = string.gsub(name,' دحوو34م ','ما هي طريقتك في الحصول على الراحة النفسية؟ ')
name = string.gsub(name,' دحوو35م ','إيموجي يعبّر عن مزاجك الحالي؟ ')
name = string.gsub(name,' دحوو36م ','أكثر تغيير ترغب أن تغيّره في نفسك؟ ')
name = string.gsub(name,' دحوو37م ',' أكثر شيء أسعدك اليوم؟ ')
name = string.gsub(name,' دحوو38م ',' بماذا يتعافى المرء؟ ')
name = string.gsub(name,' دحوو39م ',' ما هو أفضل حافز للشخص؟ ')
name = string.gsub(name,' دحوو40م ',' ما الذي يشغل بالك في الفترة الحالية؟')
name = string.gsub(name,' دحوو41م ',' آخر شيء ندمت عليه؟ ')
name = string.gsub(name,' دحوو42م ',' شاركنا صورة احترافية من تصويرك؟ ')
name = string.gsub(name,' دحوو43م ',' تتابع انمي؟ إذا نعم ما أفضل انمي شاهدته ')
name = string.gsub(name,' دحوو44م ',' يرد عليك متأخر على رسالة مهمة وبكل برود، موقفك؟ ')
name = string.gsub(name,' دحوو45م ',' نصيحه تبدا ب -لا- ؟ ')
name = string.gsub(name,' دحوو46م ',' كتاب أو رواية تقرأها هذه الأيام؟ ')
name = string.gsub(name,' دحوو47م ',' فيلم عالق في ذهنك لا تنساه مِن روعته؟ ')
name = string.gsub(name,' دحوو48م ',' يوم لا يمكنك نسيانه؟ ')
name = string.gsub(name,' دحوو49م ',' شعورك الحالي في جملة؟ ')
name = string.gsub(name,' دحوو50م ',' أكثر سبب منطقي يمكن أن يجعلك تقرر الإبتعاد عن الشخص الذي تُحب؟ ')
name = string.gsub(name,' دحوو51م ',' كلمة لشخص بعيد؟ ')
name = string.gsub(name,' دحوو52م ',' صفة يطلقها عليك الشخص المفضّل؟ ')
name = string.gsub(name,' دحوو53م ',' أغنية عالقة في ذهنك هاليومين؟ ')
name = string.gsub(name,' دحوو54م ',' أكلة مستحيل أن تأكلها؟ ')
name = string.gsub(name,' دحوو55م ',' كيف قضيت نهارك؟ ')
name = string.gsub(name,' دحوو56م ',' تصرُّف ماتتحمله؟ ')
name = string.gsub(name,' دحوو57م ',' صفة يطلقها عليك من حولك بكثرة؟ ')
name = string.gsub(name,' دحوو58م ',' اسوء صفه فيك وتجاهد على تغييرها؟ ')
name = string.gsub(name,' دحوو59م ',' شاركنا أقوى بيت شِعر من تأليفك؟ ')
name = string.gsub(name,' دحوو60م ',' ماذا لو عاد معتذراً؟ ')
name = string.gsub(name,' دحوو61م ',' تقطع علاقتك بالشخص إذا عرفت إنه...؟ ')
name = string.gsub(name,' دحوو62م ',' كلام ودك يوصل للشخص المطلوب ؟ ')
name = string.gsub(name,' دحوو63م ',' ردة فعلك لمن يتجاهلك بالرد متعمد؟ ')
name = string.gsub(name,' دحوو64م ',' كم نسبة البيتوتية في شخصيتك؟ ')
name = string.gsub(name,' دحوو65م ',' متى تحس أنك فعلًا أنسان صبور جدًا ؟ ')
name = string.gsub(name,' دحوو66م ',' هل أنت من النوع الذي يواجه المشاكل أو من النوع الذي يهرب ؟ ')
name = string.gsub(name,' دحوو67م ',' أمنية كنت تتمناها وحققتها ؟ ')
name = string.gsub(name,' دحوو68م ',' تملك وسواس من شيء معين ؟ ')
name = string.gsub(name,' دحوو69م ',' عمرك انتقمت من أحد ؟! ')
name = string.gsub(name,' دحوو70م ',' متى تقرر تنسحب من أي علاقة ؟ ')
name = string.gsub(name,' دحوو71م ',' كلمتين تكررها دايم ؟! ')
name = string.gsub(name,' دحوو72م ',' افضل هديه ممكن تناسبك؟ ')
name = string.gsub(name,' دحوو73م ',' انت حزين اول شخص تتصل عليه؟ ')
name = string.gsub(name,' دحوو74م ',' موقف خلاك تحس انك مكسور ؟ ')
name = string.gsub(name,' دحوو75م ',' ماذا لو كانت مشاعر البشر مرئية ؟ ')
name = string.gsub(name,' دحوو76م ',' كم تشوف انك تستحق فرصه؟ ')
name = string.gsub(name,' دحوو77م ',' يهمك ظن الناس فيك ولا ؟ ')
name = string.gsub(name,' دحوو78م ',' اغنية عندك معاها ذكريات ')
name = string.gsub(name,' دحوو79م ',' موقف غير حياتك؟ ')
name = string.gsub(name,' دحوو80م ',' اكثر مشروب تحبه؟ ')
name = string.gsub(name,' دحوو81م ',' القصيدة اللي تأثر فيك؟ ')
name = string.gsub(name,' دحوو82م ',' متى يصبح الصديق غريب ')
name = string.gsub(name,' دحوو83م ',' هل وصلك رسالة غير متوقعة من شخص وأثرت فيك ؟ ')
name = string.gsub(name,' دحوو84م ',' وين نلقى السعاده برايك؟ ')
name = string.gsub(name,' دحوو85م ',' تاريخ ميلادك؟ ')
name = string.gsub(name,' دحوو86م ',' قهوه و لا شاي؟ ')
name = string.gsub(name,' دحوو87م ',' من محبّين الليل أو الصبح؟ ')
name = string.gsub(name,' دحوو88م ',' حيوانك المفضل؟ ')
name = string.gsub(name,' دحوو89م ',' كلمة غريبة ومعناها؟ ')
name = string.gsub(name,' دحوو90م ',' هل التعود على شخص والتحدث معه بشكل يومي يعتبر نوع من أنواع الحب؟ ')
name = string.gsub(name,' دحوو91م ',' كم تحتاج من وقت لتثق بشخص؟ ')
name = string.gsub(name,' دحوو92م ',' اشياء نفسك تجربها؟ ')
name = string.gsub(name,' دحوو93م ',' يومك ضاع على؟ ')
name = string.gsub(name,' دحوو94م ',' كل شيء يهون الا ؟ ')
name = string.gsub(name,' دحوو95م ',' اسم ماتحبه ؟ ')
name = string.gsub(name,' دحوو96م ',' وقفة إحترام للي إخترع ؟ ')
name = string.gsub(name,' دحوو97م ',' أقدم شيء محتفظ فيه من صغرك؟ ')
name = string.gsub(name,' دحوو98م ',' كلمات ماتستغني عنها بسوالفك؟ ')
name = string.gsub(name,' دحوو99م ',' وش الحب بنظرك؟ ')
name = string.gsub(name,' دحوو100م ',' حب التملك في شخصِيـتك ولا ؟ ')
name = string.gsub(name,' دحوو101م ',' تخطط للمستقبل ولا ؟ ')
name = string.gsub(name,' دحوو102م ',' موقف محرج ماتنساه ؟ ')
name = string.gsub(name,' دحوو103م ',' من طلاسم لهجتكم ؟ ')
name = string.gsub(name,' دحوو104م ',' اعترف باي حاجه ؟ ')
name = string.gsub(name,' دحوو105م ',' عبّر عن مودك بصوره ؟ ')
name = string.gsub(name,' دحوو106م ',' اسم دايم ع بالك ؟ ')
name = string.gsub(name,' دحوو107م ',' اشياء تفتخر انك م سويتها ؟ ')
name = string.gsub(name,' دحوو108م ','  لو بكيفي كان ؟ ')
name = string.gsub(name,' دحوو109م ',' تحب تحتفظ بالذكريات ؟ ')
name = string.gsub(name,' دحوو110م ',' اغلب وقتك ضايع في؟ ')
name = string.gsub(name,' دحوو111م ',' اكثر كلمة تنقال لك بالبيت ؟ ')
name = string.gsub(name,' دحوو112م ',' كلمتك التسليكيه ؟ ')
name = string.gsub(name,' دحوو113م ',' تزعلك الدنيا ويرضيك ؟ ')
name = string.gsub(name,' دحوو114م ',' عندك فوبيا او خوف شديد من شيء معين ؟ ')
name = string.gsub(name,' دحوو115م ','  غزل بلهجتك ؟ ')
name = string.gsub(name,' دحوو116م ',' ردة فعلك لما تنظلم من شخص ؟ ')
name = string.gsub(name,' دحوو117م ',' شيء تعترف انك فاشل فيه ؟ ')
name = string.gsub(name,' دحوو118م ',' اكثر كلمة ترفع ضغطك ؟ ')
name = string.gsub(name,' دحوو119م ',' نسبة جمال صوتك ؟ ')
name = string.gsub(name,' دحوو120م ',' كيف تتعامل مع الشخص المُتطفل ( الفضولي ) ؟ ')
name = string.gsub(name,' دحوو121م ',' من الاشياء اللي تجيب لك الصداع ؟ ')
name = string.gsub(name,' دحوو122م ',' حصلت الشخص اللي يفهمك ولا باقي ؟ ')
send(msg.chat_id_, msg.id_,'✧|*'..name..'*')
return false
end
end
------------------------------------------------------------------------
if text == ''..(database:get(bot_id..'Klam:Twt'..msg.chat_id_) or '')..'' and not database:get(bot_id..'Set:twt'..msg.chat_id_) then
if not database:get(bot_id..'Set:Twt'..msg.chat_id_) then 
send(msg.chat_id_, msg.id_,'*✧ احسنت اجـابـتـك صـحيـحـة ✧*')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 1)  
end
database:set(bot_id..'Set:Twt'..msg.chat_id_,true)
end 

if text == 'المعاني' or text == 'معاني' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'🗳️| لا تستطيع استخدام البوت يرجى الاشتراك في القناة حتى تتمكن من استخدام الاوامر \n 📌| اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
database:del(bot_id..'Set:Maany'..msg.chat_id_)
Maany_Rand = {'قرد','حصان','ارنب','حيه','نمله','قطه','كلب','ثور','ماعز','خروف','سلحفات','حوت','ورده','نخله','شجره','شمس','هلال','كامره','حلزون','مسدس','طياره','سياره','كرز','ركي','فروله','منزل','كره','نجمه','ساعه','راديو','باب','قارب','دجاجه','بطريق','ضفدع','بومه','نحله','ديج','جمل','بقره','دولفين','تمساح','قرش','نمر','اخطبوط','سمكه','خفاش','اسد','فأر','ذئب','فراشه','عقرب','زرافه','قنفذ','تفاحه','باذنجان'}
name = Maany_Rand[math.random(#Maany_Rand)]
database:set(bot_id..'Maany'..msg.chat_id_,name)
name = string.gsub(name,'قرد','🐒')
name = string.gsub(name,'حصان','🐎')
name = string.gsub(name,'ارنب','🐇')
name = string.gsub(name,'حيه','🐍')
name = string.gsub(name,'نمله','🐜')
name = string.gsub(name,'قطه','🐈')
name = string.gsub(name,'كلب','🐕')
name = string.gsub(name,'ثور','🐂')
name = string.gsub(name,'ماعز','🐐')
name = string.gsub(name,'خروف','🐏')
name = string.gsub(name,'سلحفات','🐢')
name = string.gsub(name,'حوت','🐳')
name = string.gsub(name,'ورده','🌷')
name = string.gsub(name,'نخله','🌴')
name = string.gsub(name,'شجره','🌳')
name = string.gsub(name,'شمس','🌞')
name = string.gsub(name,'هلال','🌙')
name = string.gsub(name,'كامره','📷')
name = string.gsub(name,'كامره','📹')
name = string.gsub(name,'حلزون','🐌')
name = string.gsub(name,'مسدس','🔫')
name = string.gsub(name,'طياره','🚁')
name = string.gsub(name,'سياره','🚘')
name = string.gsub(name,'كرز','🍒')
name = string.gsub(name,'ركي','🍉')
name = string.gsub(name,'فروله','🍓')
name = string.gsub(name,'منزل','🏫')
name = string.gsub(name,'كره','⚽')
name = string.gsub(name,'نجمه','🌟')
name = string.gsub(name,'ساعه','🕞')
name = string.gsub(name,'راديو','📻')
name = string.gsub(name,'باب','🚪')
name = string.gsub(name,'قارب','⛵')
name = string.gsub(name,'دجاجه','🐔')
name = string.gsub(name,'بطريق','🐧')
name = string.gsub(name,'ضفدع','🐸')
name = string.gsub(name,'بومه','🦉')
name = string.gsub(name,'نحله','🐝')
name = string.gsub(name,'ديج','🐓')
name = string.gsub(name,'جمل','🐫')
name = string.gsub(name,'بقره','🐄')
name = string.gsub(name,'دولفين','🐬')
name = string.gsub(name,'تمساح','🐊')
name = string.gsub(name,'قرش','🦈')
name = string.gsub(name,'نمر','🐅')
name = string.gsub(name,'اخطبوط','🐙')
name = string.gsub(name,'سمكه','🐟')
name = string.gsub(name,'خفاش','🦇')
name = string.gsub(name,'اسد','🦁')
name = string.gsub(name,'فأر','🐭')
name = string.gsub(name,'ذئب','🐺')
name = string.gsub(name,'فراشه','🦋')
name = string.gsub(name,'عقرب','🦂')
name = string.gsub(name,'زرافه','🦒')
name = string.gsub(name,'قنفذ','🦔')
name = string.gsub(name,'تفاحه','🍎')
name = string.gsub(name,'باذنجان','🍆')
send(msg.chat_id_, msg.id_,'*✧| اسرع واحد يرسل معنى السمايل  » {'..name..'}*')
return false
end
end
------------------------------------------------------------------------
if text == ''..(database:get(bot_id..'Maany'..msg.chat_id_) or '')..'' and not database:get(bot_id..'Set:Maany'..msg.chat_id_) then
if not database:get(bot_id..'Set:Maany'..msg.chat_id_) then 
send(msg.chat_id_, msg.id_,'*✧ احسنت اجـابـتـك صـحيـحـة ✧*')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 1)  
end
database:set(bot_id..'Set:Maany'..msg.chat_id_,true)
end 
if text == 'العكس' or text == 'عكس' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'🗳️| لا تستطيع استخدام البوت يرجى الاشتراك في القناة حتى تتمكن من استخدام الاوامر \n 📌| اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
database:del(bot_id..'Set:Aks'..msg.chat_id_)
katu = {'باي','فهمت','موزين','اسمعك','احبك','موحلو','نضيف','حاره','ناصي','تحت','سريع','ونسه','طويل','سمين','ضعيف','شريف','شجاع','رحت','عدل','نشيط','شبعان','موعطشان','خوش ولد','حمار','هادئ'}
name = katu[math.random(#katu)]
database:set(bot_id..'Set:Aks:Game'..msg.chat_id_,name)
name = string.gsub(name,'باي','هلو')
name = string.gsub(name,'فهمت','مافهمت')
name = string.gsub(name,'موزين','زين')
name = string.gsub(name,'اسمعك','ماسمعك')
name = string.gsub(name,'احبك','ماحبك')
name = string.gsub(name,'موحلو','حلو')
name = string.gsub(name,'نضيف','وصخ')
name = string.gsub(name,'حاره','بارده')
name = string.gsub(name,'ناصي','عالي')
name = string.gsub(name,'تحت','فوق')
name = string.gsub(name,'سريع','بطيء')
name = string.gsub(name,'ونسه','ضوجه')
name = string.gsub(name,'طويل','قزم')
name = string.gsub(name,'سمين','ضعيف')
name = string.gsub(name,'ضعيف','قوي')
name = string.gsub(name,'شريف','كواد')
name = string.gsub(name,'شجاع','جبان')
name = string.gsub(name,'رحت','اجيت')
name = string.gsub(name,'عدل','ميت')
name = string.gsub(name,'نشيط','كسول')
name = string.gsub(name,'شبعان','جوعان')
name = string.gsub(name,'موعطشان','عطشان')
name = string.gsub(name,'خوش ولد','موخوش ولد')
name = string.gsub(name,'حمار','مطي')
name = string.gsub(name,'هادئ','عصبي')
send(msg.chat_id_, msg.id_,'✧| اسرع واحد يرسل العكس* » {'..name..'}*')
return false
end
end
------------------------------------------------------------------------
if text == ''..(database:get(bot_id..'Set:Aks:Game'..msg.chat_id_) or '')..'' and not database:get(bot_id..'Set:Aks'..msg.chat_id_) then
if not database:get(bot_id..'Set:Aks'..msg.chat_id_) then 
send(msg.chat_id_, msg.id_,'*✧ احسنت اجـابـتـك صـحيـحـة ✧*')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 1)  
end
database:set(bot_id..'Set:Aks'..msg.chat_id_,true)
end 

if database:get(bot_id.."GAME:TKMEN" .. msg.chat_id_ .. "" .. msg.sender_user_id_) then  
if text and text:match("^(%d+)$") then
local NUM = text:match("^(%d+)$")
if tonumber(NUM) > 20 then
send(msg.chat_id_, msg.id_,"🔘| عذرآ لا يمكنك تخمين عدد اكبر من ال { 20 } خمن رقم ما بين ال{ 1 و 20 }\n")
return false  end 
local GETNUM = database:get(bot_id.."GAMES:NUM"..msg.chat_id_)
if tonumber(NUM) == tonumber(GETNUM) then
database:del(bot_id..'SADD:NUM'..msg.chat_id_..msg.sender_user_id_)
database:del(bot_id.."GAME:TKMEN" .. msg.chat_id_ .. "" .. msg.sender_user_id_)   
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_,5)  
send(msg.chat_id_, msg.id_,'*🗳️| مبروك فزت ويانه وخمنت الرقم الصحيح\n🚸| تم اضافة { 5 } من النقاط \n*')
elseif tonumber(NUM) ~= tonumber(GETNUM) then
database:incrby(bot_id..'SADD:NUM'..msg.chat_id_..msg.sender_user_id_,1)
if tonumber(database:get(bot_id..'SADD:NUM'..msg.chat_id_..msg.sender_user_id_)) >= 3 then
database:del(bot_id..'SADD:NUM'..msg.chat_id_..msg.sender_user_id_)
database:del(bot_id.."GAME:TKMEN" .. msg.chat_id_ .. "" .. msg.sender_user_id_)   
send(msg.chat_id_, msg.id_,'*📮| اوبس لقد خسرت في اللعبه \n??| حظآ اوفر في المره القادمه \n🔰| كان الرقم الذي تم تخمينه { '..GETNUM..' }*')
else
send(msg.chat_id_, msg.id_,'*⚠️| اوبس تخمينك غلط \n📌| ارسل رقم تخمنه مره اخرى *')
end
end
end
end
if text == 'خمن' or text == 'التخمين' then   
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'🗳️| لا تستطيع استخدام البوت يرجى الاشتراك في القناة حتى تتمكن من استخدام الاوامر \n 📌| اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
Num = math.random(1,20)
database:set(bot_id.."GAMES:NUM"..msg.chat_id_,Num) 
send(msg.chat_id_, msg.id_,'\n*⚠️| اهلا بك عزيزي في لعبة التخمين :\nٴ━━━━━━━━━━\n'..'⚠¦ ملاحظه لديك { 3 } محاولات فقط فكر قبل ارسال تخمينك \n\n'..'🗳️| سيتم تخمين عدد ما بين ال {1 و 20} اذا تعتقد انك تستطيع الفوز جرب واللعب الان ؟ *')
database:setex(bot_id.."GAME:TKMEN" .. msg.chat_id_ .. "" .. msg.sender_user_id_, 100, true)  
return false  
end
end

if database:get(bot_id.."SET:GAME" .. msg.chat_id_ .. "" .. msg.sender_user_id_) then  
if text and text:match("^(%d+)$") then
local NUM = text:match("^(%d+)$")
if tonumber(NUM) > 6 then
send(msg.chat_id_, msg.id_,"🎗️| عذرا لا يوجد سواء { 6 } اختيارات فقط ارسل اختيارك مره اخرى\n")
return false  end 
local GETNUM = database:get(bot_id.."Games:Bat"..msg.chat_id_)
if tonumber(NUM) == tonumber(GETNUM) then
database:del(bot_id.."SET:GAME" .. msg.chat_id_ .. "" .. msg.sender_user_id_)   
send(msg.chat_id_, msg.id_,'*📮| مبروك فزت وطلعت المحيبس بل ايد رقم { '..NUM..' }\n✨|  لقد حصلت على { 3 }من نقاط يمكنك استبدالهن برسائل *')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_,3)  
elseif tonumber(NUM) ~= tonumber(GETNUM) then
database:del(bot_id.."SET:GAME" .. msg.chat_id_ .. "" .. msg.sender_user_id_)   
send(msg.chat_id_, msg.id_,'*😔| للاسف لقد خسرت \n🎗️| المحيبس بل ايد رقم { '..GETNUM..' }\n💥| حاول مره اخرى للعثور على المحيبس*')
end
end
end

if text == 'محيبس' or text == 'البات' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'🗳️| لا تستطيع استخدام البوت يرجى الاشتراك في القناة حتى تتمكن من استخدام الاوامر \n 📌| اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then   
Num = math.random(1,6)
database:set(bot_id.."Games:Bat"..msg.chat_id_,Num) 
TEST = [[
*➀       ➁     ➂      ➃      ➄     ➅
↓      ↓     ↓      ↓     ↓     ↓   
👊 ‹•› 👊 ‹•› 👊 ‹•› 👊 ‹•› 👊 ‹•› 👊
🔘| اختر لأستخراج المحيبس الايد التي تحمل المحيبس 
🎉| الفائز يحصل على { 3 } من النقاط *
]]
send(msg.chat_id_, msg.id_,TEST)
database:setex(bot_id.."SET:GAME" .. msg.chat_id_ .. "" .. msg.sender_user_id_, 100, true)  
return false  
end
end

------------------------------------------------------------------------
if text == 'المختلف' or text == 'مختلف' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'🗳️| لا تستطيع استخدام البوت يرجى الاشتراك في القناة حتى تتمكن من استخدام الاوامر \n 📌| اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
mktlf = {'😸','☠','🐼','🐇','??','🌚','⭐️','✨','⛈','🌥','⛄️','👨‍🔬','👨‍💻','👨‍🔧','👩‍🍳','🧚‍♀','??‍♂','??‍♂','🙍‍♂','🧖‍♂','👬','👨‍👨‍👧','🕒','🕤','⌛️','📅',};
name = mktlf[math.random(#mktlf)]
database:del(bot_id..'Set:Moktlf:Bot'..msg.chat_id_)
database:set(bot_id..':Set:Moktlf'..msg.chat_id_,name)
name = string.gsub(name,'😸','😹😹😹😹😹😹😹😹😸😹😹😹😹')
name = string.gsub(name,'☠','💀💀💀💀💀💀💀☠💀💀💀💀💀')
name = string.gsub(name,'🐼','👻👻👻🐼👻👻👻👻👻👻👻')
name = string.gsub(name,'🐇','🕊🕊🕊🕊🕊🐇🕊🕊🕊🕊')
name = string.gsub(name,'🌑','🌚🌚🌚🌚🌚🌑🌚🌚🌚')
name = string.gsub(name,'🌚','🌑🌑🌑🌑🌑🌚🌑🌑🌑')
name = string.gsub(name,'⭐️','🌟🌟🌟🌟🌟🌟🌟🌟⭐️🌟🌟🌟')
name = string.gsub(name,'✨','💫💫💫💫💫✨💫💫💫💫')
name = string.gsub(name,'⛈','🌨🌨🌨🌨🌨⛈🌨🌨🌨🌨')
name = string.gsub(name,'🌥','⛅️⛅️⛅️⛅️⛅️⛅️🌥⛅️⛅️⛅️⛅️')
name = string.gsub(name,'⛄️','☃☃☃☃☃☃⛄️☃☃☃☃')
name = string.gsub(name,'👨‍🔬','👩‍🔬👩‍🔬👩‍🔬👩‍🔬👩‍🔬👩‍🔬👩‍🔬👩‍🔬👨‍🔬👩‍🔬👩‍🔬👩‍🔬')
name = string.gsub(name,'👨‍💻','👩‍💻👩‍💻👩‍‍💻👩‍‍💻👩‍💻👨‍💻👩‍💻👩‍💻👩‍💻')
name = string.gsub(name,'👨‍🔧','👩‍🔧👩‍🔧👩‍🔧👩‍🔧👩‍🔧👩‍🔧👨‍🔧👩‍🔧')
name = string.gsub(name,'👩‍🍳','👨‍🍳👨‍🍳👨‍🍳👨‍🍳👨‍🍳👩‍🍳👨‍🍳👨‍🍳👨‍🍳')
name = string.gsub(name,'🧚‍♀','🧚‍♂🧚‍♂🧚‍♂🧚‍♂🧚‍♀🧚‍♂🧚‍♂')
name = string.gsub(name,'🧜‍♂','🧜‍♀🧜‍♀🧜‍♀🧜‍♀🧜‍♀🧚‍♂🧜‍♀??‍♀🧜‍♀')
name = string.gsub(name,'🧝‍♂','🧝‍♀🧝‍♀🧝‍♀🧝‍♀🧝‍♀🧝‍♂🧝‍♀🧝‍♀🧝‍♀')
name = string.gsub(name,'🙍‍♂️','🙎‍♂️🙎‍♂️🙎‍♂️🙎‍♂️🙎‍♂️🙍‍♂️🙎‍♂️🙎‍♂️🙎‍♂️')
name = string.gsub(name,'🧖‍♂️','🧖‍♀️🧖‍♀️🧖‍♀️🧖‍♀️🧖‍♀️🧖‍♂️🧖‍♀️🧖‍♀️🧖‍♀️🧖‍♀️')
name = string.gsub(name,'👬','👭👭👭👭👭👬👭👭👭')
name = string.gsub(name,'👨‍👨‍👧','👨‍👨‍👦👨‍👨‍👦👨‍👨‍👦👨‍👨‍👦👨‍👨‍👧👨‍👨‍👦👨‍👨‍👦')
name = string.gsub(name,'🕒','🕒🕒🕒🕒🕒🕒🕓🕒🕒🕒')
name = string.gsub(name,'🕤','🕥🕥🕥🕥🕥🕤🕥🕥🕥')
name = string.gsub(name,'⌛️','⏳⏳⏳⏳⏳⏳⌛️⏳⏳')
name = string.gsub(name,'📅','📆📆📆📆📆📆📅📆📆')
send(msg.chat_id_, msg.id_,'*✧| اسرع واحد يرسل الاختلاف » {'..name..'}*')
return false
end
end
------------------------------------------------------------------------
if text == ''..(database:get(bot_id..':Set:Moktlf'..msg.chat_id_) or '')..'' then 
if not database:get(bot_id..'Set:Moktlf:Bot'..msg.chat_id_) then 
database:del(bot_id..':Set:Moktlf'..msg.chat_id_)
send(msg.chat_id_, msg.id_,'*✧ احسنت اجـابـتـك صـحيـحـة ✧*')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 1)  
end
database:set(bot_id..'Set:Moktlf:Bot'..msg.chat_id_,true)
end
------------------------------------------------------------------------
if text == 'الرياضيات' or text == 'رياضيات' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'🗳️| لا تستطيع استخدام البوت يرجى الاشتراك في القناة حتى تتمكن من استخدام الاوامر \n 📌| اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
Hussein = {'9','2','60','9','5','4','25','10','17','15','39','5','16',};
name = Hussein[math.random(#Hussein)]
database:del(bot_id..'Set:Ryadeat:Bot'..msg.chat_id_)
database:set(bot_id..':Set:Ryadeat'..msg.chat_id_,name)
name = string.gsub(name,'9','2+7=')
name = string.gsub(name,'2','5-3=')
name = string.gsub(name,'60','(30)² =')
name = string.gsub(name,'9','2+2+5=')
name = string.gsub(name,'5','8-3=?')
name = string.gsub(name,'4','40÷10=')
name = string.gsub(name,'25','30-5=')
name = string.gsub(name,'10','100÷10=')
name = string.gsub(name,'17','10+5+2=')
name = string.gsub(name,'15','25-10=')
name = string.gsub(name,'39','44-5=')
name = string.gsub(name,'5','12+1-8=')
name = string.gsub(name,'16','16+16-16=')
send(msg.chat_id_, msg.id_,'✧ كم ناتج العمليه الحسابيه التاليه* » {'..name..'}*')
return false
end
end
------------------------------------------------------------------------
if text == ''..(database:get(bot_id..':Set:Ryadeat'..msg.chat_id_) or '')..'' then 
if not database:get(bot_id..'Set:Ryadeat:Bot'..msg.chat_id_) then 
database:del(bot_id..':Set:Ryadeat'..msg.chat_id_)
send(msg.chat_id_, msg.id_,'*✧ احسنت اجـابـتـك صـحيـحـة ✧*')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 1)  
end
database:set(bot_id..'Set:Ryadeat:Bot'..msg.chat_id_,true)
end
------------------------------------------------------------------------
if text == 'انجليزي' or text == 'الانجليزي' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'🗳️| لا تستطيع استخدام البوت يرجى الاشتراك في القناة حتى تتمكن من استخدام الاوامر \n 📌| اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
Hussein = {  'افتح','باب','الافضل','جدار','طيران','ورده','جيد','سيء','اريد','غريب','خطير','يهتم','حفظ','تحرك','ربما','ثقة','حقيقه','صندوق','يد','شجاع','هادئ','حذر','مرح','ذكي','جبان','مجنون','عاطفي','ودود','مضحك','كريم','صادق','غير صبور','غير مهذب','حنون','كسول','حقير','مريض',};
name = Hussein[math.random(#Hussein)]
database:del(bot_id..'Set:English:Bot'..msg.chat_id_)
database:set(bot_id..':Set:English'..msg.chat_id_,name)
name = string.gsub(name,'افتح','Open')
  name = string.gsub(name,'باب','Door')
  name = string.gsub(name,'الافضل','Best')
  name = string.gsub(name,'جدار','Wall')
  name = string.gsub(name,'طيران','Fly')
  name = string.gsub(name,'ورده','Flower')
  name = string.gsub(name,'جيد','Good')
  name = string.gsub(name,'سيء','Bay')
  name = string.gsub(name,'اريد','Want')
  name = string.gsub(name,'غريب','Stranger')
  name = string.gsub(name,'خطير','Dangerous')
  name = string.gsub(name,'يهتم','Care')
  name = string.gsub(name,'حفظ','Save')
  name = string.gsub(name,'تحرك','Move')
  name = string.gsub(name,'ربما','Maybe')
  name = string.gsub(name,'ثقة','Trust')
  name = string.gsub(name,'حقيقه','Truth')
  name = string.gsub(name,'صندوق','Box')
  name = string.gsub(name,'يد','Hand')
  name = string.gsub(name,'شجاع','Brave')
  name = string.gsub(name,'هادئ','Calm')
  name = string.gsub(name,'حذر','Cautious')
  name = string.gsub(name,'مرح','Cheerful')
  name = string.gsub(name,'ذكي','Clever')
  name = string.gsub(name,'جبان','Cowardly')
  name = string.gsub(name,'مجنون','Crazy')
  name = string.gsub(name,'عاطفي','Emotional')
  name = string.gsub(name,'ودود','Friendly')
  name = string.gsub(name,'مضحك','Funny')
  name = string.gsub(name,'كريم','Generous')
  name = string.gsub(name,'صادق','Honest')
  name = string.gsub(name,'غير صبور','Impatient')
  name = string.gsub(name,'غير مهذب','Impolite')
  name = string.gsub(name,'حنون','Kind')
  name = string.gsub(name,'كسول','Lazy')
  name = string.gsub(name,'حقير','Mean')
  name = string.gsub(name,'مريض','Patient')
send(msg.chat_id_, msg.id_,'✧ ماذا تعني هذه الكلمة *~ { '..name..' }*')
return false
end
end

------------------------------------------------------------------------
if text == ''..(database:get(bot_id..':Set:English'..msg.chat_id_) or '')..'' then 
if not database:get(bot_id..'Set:English:Bot'..msg.chat_id_) then 
database:del(bot_id..':Set:English'..msg.chat_id_)
send(msg.chat_id_, msg.id_,'*✧ احسنت اجـابـتـك صـحيـحـة ✧*')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 1)  
end
database:set(bot_id..'Set:English:Bot'..msg.chat_id_,true)
end

if text == 'امثله' or text == 'الامثله' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'🗳️| لا تستطيع استخدام البوت يرجى الاشتراك في القناة حتى تتمكن من استخدام الاوامر \n 📌| اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
mthal = {'الحبل','سلايه','الخيل','الصقر','المبلل','يرقص','القرد','الدله','يعرفك','زيد','اقرد','مقصه','العنب','اليد','الخبز','بالحصاد','شهر','شكى','يكحلها',};
name = mthal[math.random(#mthal)]
database:set(bot_id..'Set:Amth'..msg.chat_id_,name)
database:del(bot_id..'Set:Amth:Bot'..msg.chat_id_)
name = string.gsub(name,'سلايه','بالوجه امراية وبالظهر...........')
name = string.gsub(name,'الخيل','من قلة.........شدو على الكلاب سروج')
name = string.gsub(name,'الصقر','اللي ما يعرف.......... يشويه')
name = string.gsub(name,'المبلل','..........ما يخاف من المطر')
name = string.gsub(name,'الحبل','اللي تلدغة الحية يخاف من جرة..........')
name = string.gsub(name,'يرقص','المايعرف..........يقول القاع عوجه')
name = string.gsub(name,'العنب','اللي ما يطول............ حامضاً عنه يقول')
name = string.gsub(name,'الدله','أقلب ........على فمها تطلع البنت لأمها')
name = string.gsub(name,'الخبز','اعطي.........للخباز حتى لو ياكل نصه')
name = string.gsub(name,'بالحصاد','اسمة.........ومنجله مكسور')
name = string.gsub(name,'شهر','امشي...........ولا تعبر نهر')
name = string.gsub(name,'شكى','يامن تعب يامن........يا من على الحاضر لقى')
name = string.gsub(name,'القرد','.........بعين امه غزال')
name = string.gsub(name,'يكحلها','اجه..........عماها')
name = string.gsub(name,'مقصه','كل شارب وله ..........')
name = string.gsub(name,'يعرفك','اللي ما.......... ما يثمنك')
name = string.gsub(name,'زيد','كأنك يا بو ..........ما غزيت')
name = string.gsub(name,'اقرد','أرضي بقردك لا يجيك ......... منه')
name = string.gsub(name,'اليد','العين بصيره و.......... قصيره.')
send(msg.chat_id_, msg.id_,'✧| اسرع واحد يكمل المثل* » {'..name..'}*')
return false
end
end
------------------------------------------------------------------------
if text == ''..(database:get(bot_id..'Set:Amth'..msg.chat_id_) or '')..'' then 
if not database:get(bot_id..'Set:Amth:Bot'..msg.chat_id_) then 
database:del(bot_id..'Set:Amth'..msg.chat_id_)
send(msg.chat_id_, msg.id_,'*✧ احسنت اجـابـتـك صـحيـحـة ✧*')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 3)  
end
database:set(bot_id..'Set:Amth:Bot'..msg.chat_id_,true)
end
------------------------------------------------------------------------
if text == 'اسئله' or text == 'الاسئله' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'🗳️| لا تستطيع استخدام البوت يرجى الاشتراك في القناة حتى تتمكن من استخدام الاوامر \n 📌| اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
database:del(bot_id..'Bos:Tr'..msg.chat_id_)
KlamBos = {'سيف الدين','عبدالملك بن مروان','1914','الملك خفرع','سورة طه','الروم','التبت','روسيا','الانف والاذن','8كواكب','الارز','شرغوف','الفهد','الثديات','النمر','باسكال','1939'};
name = KlamBos[math.random(#KlamBos)]
database:set(bot_id..'Klam:Bos'..msg.chat_id_,name)
name = string.gsub(name,'سيف الدين','من هو القائد الإسلامي الذي انتصر على التتار والمغول وهزم هولاكو?')
name = string.gsub(name,'عبدالملك بن مروان','من هو أول من قام بصكّ النقود عند العرب?')
name = string.gsub(name,'1914','متى وقعت الحرب العالمية الأولى?')
name = string.gsub(name,'الملك خفرع','من هو الملك الفرعوني الذي قام ببناء تمثال أبي الهول؟')
name = string.gsub(name,'سورة طه','ما هي السورة التي تسببت في إسلام الصحابي الجليل عمر بن الخطّاب؟')
name = string.gsub(name,'الروم','ما هي آخر سورة نزلت في مكّة المكرّمة؟')
name = string.gsub(name,'التبت','ما هي أكبر هضبة في العالم؟')
name = string.gsub(name,'روسيا','ما هي أكبر دولة في العالم من حيث المساحة؟')
name = string.gsub(name,'الانف والاذن','ما هما العضوان اللذان يستمران بالنمو طوال حياة الإنسان؟')
name = string.gsub(name,'8كواكب','ما هو عدد كواكب المجموعة الشمسية؟')
name = string.gsub(name,'الارز','ما هو الغذاء الأساسي لثلث سكّان العالم؟')
name = string.gsub(name,'شرغوف','ماذا يُسمى صغير الضفدع؟')
name = string.gsub(name,'الفهد','ما هو أسرع حيوان بري في العالم؟')
 name = string.gsub(name,'الثديات','إلى أي نوع من الحيوانات تنتمي الدلافين؟')
name = string.gsub(name,'النمر','ما هو أكبر أنواع القطط في العالم؟')
name = string.gsub(name,'باسكال','من هو مخترع الآلة الحاسبة؟')
name = string.gsub(name,'1939','متى وقعت الحرب العالمية الثانية?')
send(msg.chat_id_, msg.id_,'✧| اسرع واحد يحل اللغز* » {'..name..'}*')
return false
end
end
------------------------------------------------------------------------
if text == ''..(database:get(bot_id..'Klam:Bos'..msg.chat_id_) or '')..'' and not database:get(bot_id..'Bos:Tr'..msg.chat_id_) then
if not database:get(bot_id..'Bos:Tr'..msg.chat_id_) then 
send(msg.chat_id_, msg.id_,'*✧ احسنت اجـابـتـك صـحيـحـة ✧*')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 1)  
end
database:set(bot_id..'Bos:Tr'..msg.chat_id_,true)
end 
if text == 'الاسرع' or text == 'اسرع' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'🗳️| لا تستطيع استخدام البوت يرجى الاشتراك في القناة حتى تتمكن من استخدام الاوامر \n 📌| اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
alasra = {'قرد','دجاجه','بطريق','ضفدع','بومه','نحله','ديك','جمل','بقره','دولفين','تمساح','قرش','نمر','اخطبوط','سمكه','خفاش','اسد','فأر','ذئب','فراشه','عقرب','زرافه','قنفذ','العراق','سلام عليكم ورحمة الله وبركاتة','بوووووووت😂','يرسل😛','انا اهبل','انا ثور','انا هطف','تفاحه','باذنجان',};
name = alasra[math.random(#alasra)]
database:del(bot_id..'Set:alasra:Bot'..msg.chat_id_)
database:set(bot_id..':Set:alasra'..msg.chat_id_,name)
name = string.gsub(name,'الراقي','الراقي')
name = string.gsub(name,'دجاجه','دجاجه')
name = string.gsub(name,'بطريق','بطريق')
name = string.gsub(name,'ضفدع','ضفدع')
name = string.gsub(name,'خنفشار','خنفشار')
name = string.gsub(name,'العراق','العراق')
name = string.gsub(name,'سلام عليكم ورحمة الله وبركاتة','سلام عليكم ورحمة الله وبركاتة')
name = string.gsub(name,'بوووووووت😂','بوووووووت😂')
name = string.gsub(name,'يرسل😛','يرسل😛')
name = string.gsub(name,'انا اهبل','انا اهبل')
name = string.gsub(name,'انا هطف','انا هطف')
name = string.gsub(name,'انا ثور','انا ثور')
name = string.gsub(name,'قرنبيط','قرنبيط')
name = string.gsub(name,'القسطنطينيه','القسطنطينيه')
name = string.gsub(name,'سوريا','سوريا')
name = string.gsub(name,'اليمن','اليمن')
name = string.gsub(name,'تمساح','تمساح')
name = string.gsub(name,'السعوديه','السعوديه')
name = string.gsub(name,'نمر','نمر')
name = string.gsub(name,'اخطبوط','اخطبوط')
name = string.gsub(name,'سمكه','سمكه')
name = string.gsub(name,'خفاش','خفاش')
name = string.gsub(name,'الامارات','الامارات')
name = string.gsub(name,'مصر','مصر')
name = string.gsub(name,'سورس الراقي','سورس الراقي')
name = string.gsub(name,'البحرين','البحرين')
name = string.gsub(name,'مع نفسك','مع نفسك')
name = string.gsub(name,'زرافه','زرافه')
name = string.gsub(name,'قنفذ','قنفذ')
name = string.gsub(name,'سورس','سورس')
name = string.gsub(name,'باذنجان','باذنجان')
send(msg.chat_id_, msg.id_,'✧| اسرع واحد يرسل الكلمة* » {'..name..'}*')
return false
end
end
------------------------------------------------------------------------
 if text == ''..(database:get(bot_id..':Set:alasra'..msg.chat_id_) or '')..'' then 
if not database:get(bot_id..'Set:alasra:Bot'..msg.chat_id_) then 
database:del(bot_id..':Set:alasra'..msg.chat_id_)
send(msg.chat_id_, msg.id_,'*✧ احسنت اجـابـتـك صـحيـحـة ✧*')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 1)  
end
database:set(bot_id..'Set:alasra:Bot'..msg.chat_id_,true)
end
if text == 'علم الدول' or text == 'اعلام' or text == 'علم الدوله' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'🗳️| لا تستطيع استخدام البوت يرجى الاشتراك في القناة حتى تتمكن من استخدام الاوامر \n 📌| اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
database:del(bot_id..'Dwl:Tr'..msg.chat_id_)
KlamDwl = {'روسيا','تركيا','اليابان','كندا','البرازيل','استراليا','الصومال','عمان','ليبيا','الجزائر','السودان','الكويت','سوريا','تونس','لبنان','الامارات','فلسطين','الاردن','البحرين','قطر','مصر','السعودية','العراق','اليمن',};
name = KlamDwl[math.random(#KlamDwl)]
database:set(bot_id..'Klam:Dwl'..msg.chat_id_,name)
name = string.gsub(name,'روسيا','🇷🇺')
name = string.gsub(name,'تركيا','🇹🇷')
name = string.gsub(name,'اليابان','🇯🇵')
name = string.gsub(name,'كندا','🇨🇦')
name = string.gsub(name,'البرازيل','🇧🇷')
name = string.gsub(name,'استراليا','🇦🇺')
name = string.gsub(name,'الصومال','🇸🇴')
name = string.gsub(name,'عمان','🇴🇲')
name = string.gsub(name,'ليبيا','🇱🇾')
name = string.gsub(name,'الجزائر','🇩🇿')
name = string.gsub(name,'الكويت','🇰🇼')
name = string.gsub(name,'السودان','🇸🇩')
name = string.gsub(name,'سوريا','🇸🇾')
name = string.gsub(name,'تونس','🇹🇳')
name = string.gsub(name,'لبنان','🇱🇧')
name = string.gsub(name,'الامارات','🇦🇪')
name = string.gsub(name,'فلسطين','🇵🇸')
name = string.gsub(name,'الاردن','🇯🇴')
name = string.gsub(name,'البحرين','🇧🇭')
name = string.gsub(name,'قطر','🇶🇦')
name = string.gsub(name,'مصر','🇪🇬')
name = string.gsub(name,'السعودية','🇸🇦')
name = string.gsub(name,'العراق','🇮🇶')
name = string.gsub(name,'اليمن','🇾🇪')
send(msg.chat_id_, msg.id_,'*✧| أسرع شخص يرسل اسم الدولة » {'..name..'}*')
return false
end
end
------------------------------------------------------------------------
if text == ''..(database:get(bot_id..'Klam:Dwl'..msg.chat_id_) or '')..'' and not database:get(bot_id..'Dwl:Tr'..msg.chat_id_) then
if not database:get(bot_id..'Dwl:Tr'..msg.chat_id_) then 
send(msg.chat_id_, msg.id_,'*✧ احسنت اجـابـتـك صـحيـحـة ✧*')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 5)  
end
database:set(bot_id..'Dwl:Tr'..msg.chat_id_,true)
end  
if text == 'تعطيل العاب البوت' and Manager(msg) then   
if database:get(bot_id..'Lock:Games'..msg.chat_id_)  then
database:del(bot_id..'Lock:Games'..msg.chat_id_) 
Text = '\n*✧| تم تعطيل العاب البوت*' 
else
Text = '\n*✧| بالتاكيد تم تعطيل العاب البوت*'
end
send(msg.chat_id_, msg.id_,Text) 
end
if text == 'تفعيل العاب البوت' and Manager(msg) then  
if not database:get(bot_id..'Lock:Games'..msg.chat_id_)  then
database:set(bot_id..'Lock:Games'..msg.chat_id_,true) 
Text = '\n*✧| تم تفعيل العاب البوت*' 
else
Text = '\n*✧| بالتاكيد تم تفعيل العاب البوت*'
end
send(msg.chat_id_, msg.id_,Text) 
end

end
return {
Poyka = games
}